from django.db import models

GENDER_CHOICES = [('女性', '女性'),('男性', '男性'),]

AGE = [('18','18'),('19','19'),
      ('20','20'),('21','21'),('22','22'),('23','23'),('24','24'),('25','25'),('26','26'),('27','27'),('28','28'),('29','29'),
      ('30','30'),('31','31'),('32','32'),('33','33'),('34','34'),('35','35'),('36','36'),('37','37'),('38','38'),('39','39'),
      ('40','40'),('41','41'),('42','42'),('43','43'),('44','44'),('45','45'),('46','46'),('47','47'),('48','48'),('49','49'),
      ('50','50'),('51','51'),('52','52'),('53','53'),('54','54'),('55','55'),('56','56'),('57','57'),('58','58'),('59','59'),
      ('60','60'),('61','61'),('62','62'),('63','63'),('64','64'),('65','65')]

HEIGHT = [('130','130'),('131','131'),('132','132'),('133','133'),('134','134'),('135','135'),('136','136'),('137','137'),('138','138'),('139','139'),
         ('140','140'),('141','141'),('142','142'),('143','143'),('144','144'),('145','145'),('146','146'),('147','147'),('148','148'),('149','149'),
         ('150','150'),('151','151'),('152','152'),('153','153'),('154','154'),('155','155'),('156','156'),('157','157'),('158','158'),('159','159'),
         ('160','160'),('161','161'),('162','162'),('163','163'),('164','164'),('165','165'),('166','166'),('167','167'),('168','168'),('169','169'),
         ('170','170'),('171','171'),('172','172'),('173','173'),('174','174'),('175','175'),('176','176'),('177','177'),('178','178'),('179','179'),
         ('180','180'),('181','181'),('182','182'),('183','183'),('184','184'),('185','185'),('186','186'),('187','187'),('188','188'),('189','189'),
         ('190','190'),('191','191'),('192','192'),('193','193'),('194','194'),('195','195'),('196','196'),('197','197'),('198','198'),('199','199'),
         ('200','200')]

BODY_SHAPE = [('1','スリム'),('2','やや細め'),('3','普通'),('4','グラマー'),('5','筋肉質'),('6','ややぽっちゃり'),('7','ぽっちゃり'),]

JOB = [('大手企業','大手企業'),('公務員','公務員'),('受付','受付'),('事務員','事務員'),('看護師','看護師'),('保育士', '保育士'),
        ('客室乗務員','客室乗務員'),('秘書','秘書'),('教育関連','教育関連'),('福祉・介護', '福祉・介護'),('調理師・栄養士','調理師・栄養士'),
        ('アパレル','アパレル'),('美容関係', '美容関係'),('ブライダル', 'ブライダル'),('金融','金融'),('保険','保険'),('マスコミ','マスコミ'),
        ('WEB業界','WEB業界'),('上場企業', '上場企業'),('経営者・役員', '経営者・役員'),('医師', '医師'),('薬剤師','薬剤師'),('弁護士', '弁護士'),
        ('公認会計士', '公認会計士'),('パイロット','パイロット'),('大手商社','大手商社'),('コンサル','コンサル'),('大手外資', '大手外資'),
        ('外資金融','外資金融'),('IT関連', 'IT関連'),('クリエイター', 'クリエイター'),('アナウンサー','アナウンサー'),('芸能・モデル','芸能・モデル'),
        ('イベントコンパニオン', 'イベントコンパニオン'),('スポーツ選手', 'スポーツ選手'),('ミュージシャン','ミュージシャン'),('接客業','接客業'),('不動産','不動産'),
        ('建築関連','建築関連'),('通信','通信'),('流通', '流通'),('製薬','製薬'),('食品関連','食品関連'),('旅行関連','旅行関連'),
        ('エンターテイメント', 'エンターテイメント'),('会社員','会社員'),('学生', '学生'),('自由業','自由業'),('税理士', '税理士'),
        ('エンジニア','エンジニア'),('建築家','建築家'),('美容師','美容師'),('歯科医師','歯科医師'),('歯科衛生士', '歯科衛生士'),('その他','その他')]

YEARLY_INCOME = [("200","200"),("300","300"),("400","400"),("500","500"),("600","600"),("700","700"),("800","800"),("800","800"),("900","900"),("1000","1000"),
                ("1500","1500"),("2000","2000"),("3000","3000")]

HOLIDAYS = [('土日','土日'),('平日','平日'),('不定期','不定期'),('その他','その他')]

EDUCATION = [('短大/専門学校/高専卒','短大/専門学校/高専卒'),('高校卒','高校卒'),('大学卒','大学卒'),('大学院卒','大学院卒')]

LIVING_IN = [('北海道','北海道'),('青森','青森'),('岩手','岩手'),('宮城','宮城'),('秋田','秋田'),('山形','山形'),('福島','福島'),('茨城','茨城'),
            ('栃木','栃木'),('群馬','群馬'),('埼玉','埼玉'),('千葉','千葉'),('東京','東京'),('神奈川','神奈川'),('新潟','新潟'),('富山','富山'),
            ('石川','石川'),('福井','福井'),('山梨','山梨'),('長野','長野'),('岐阜','岐阜'),('静岡','静岡'),('愛知','愛知'),('三重','三重'),
            ('滋賀','滋賀'),('京都','京都'),('大阪','大阪'),('兵庫','兵庫'),('奈良','奈良'),('和歌山','和歌山'),('鳥取','鳥取'),('島根','島根'),
            ('岡山','岡山'),('広島','広島'),('山口','山口'),('徳島','徳島'),('香川','香川'),('愛媛','愛媛'),('高知','高知'),('福岡','福岡'),
            ('佐賀','佐賀'),('長崎','長崎'),('熊本','熊本'),('大分','大分'),('宮崎','宮崎'),('鹿児島','鹿児島'),('沖縄','沖縄'),('海外','海外')]

ALCOHOL = [('飲まない','飲まない'),('飲む','飲む'),('ときどき飲む','ときどき飲む')]

CIGARETTE = [('吸わない','吸わない'),('吸う','吸う'),('吸う（電子タバコ）','吸う（電子タバコ）'),('非喫煙者の前では吸わない','非喫煙者の前では吸わない'),
             ('相手が嫌ならやめる','相手が嫌ならやめる'),('ときどき吸う','ときどき吸う')]

class Profile(models.Model):
    name = models.CharField('名前', max_length=100)
    gender = models.CharField('性別', max_length=10, choices=GENDER_CHOICES)
    age = models.CharField('年齢', max_length=2, choices=AGE)
    height = models.CharField('身長', max_length=3, choices=HEIGHT)
    body_shape = models.CharField('体型', max_length=20, choices=BODY_SHAPE)
    job = models.CharField('職業', max_length=20, choices=JOB)
    yearly_income = models.CharField('年収', max_length=6, choices=YEARLY_INCOME)
    holidays = models.CharField('休日', max_length=20, choices=HOLIDAYS)
    education = models.CharField('学歴', max_length=20, choices=EDUCATION)
    living_in  = models.CharField('居住地', max_length=10, choices=LIVING_IN)
    alcohol = models.CharField('お酒', max_length=20, choices=ALCOHOL )
    cigarette = models.CharField('たばこ', max_length=20, choices=CIGARETTE)
